In [1]:
import pandas as pd
import numpy as np

In [22]:
data = {
    'Name' : ["Siddhi", "Purva", "Nirja", "Jiya", "Zinku"],
    'Age' : [27, 31, 32, 19, 17],
    'Address' : ['Vyara', 'Mandvi', 'Kim', 'Magarkui', 'Magarkui']
}
df = pd.DataFrame(data)
df

     Name  Age   Address
0  Siddhi   27     Vyara
1   Purva   31    Mandvi
2   Nirja   32       Kim
3    Jiya   19  Magarkui
4   Zinku   17  Magarkui

In [23]:
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

     Name  Age   Address
A  Siddhi   27     Vyara
B   Purva   31    Mandvi
C   Nirja   32       Kim
D    Jiya   19  Magarkui
E   Zinku   17  Magarkui

In [24]:
pd.read_csv("googleplaystore_v2.csv")

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19000.000000,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14000.000000,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite â€“ FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8700.000000,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25000.000000,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2800.000000,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53000.000000,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3600.000000,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9500.000000,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,21516.529524,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19000.000000,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [25]:
pd.read_excel("pandasss.xlsx")

   col1  col2
0     1    45
1     2    54
2     3     7
3     4     8
4     5    45
5     6    98
6     7    77
7     8    52
8     9    98
9    10    45

In [26]:
help(pd.DataFrame.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

In [27]:
df['Name']

A    Siddhi
B     Purva
C     Nirja
D      Jiya
E     Zinku
Name: Name, dtype: object

In [28]:
df[['Age', 'Address']]

   Age   Address
A   27     Vyara
B   31    Mandvi
C   32       Kim
D   19  Magarkui
E   17  Magarkui

In [29]:
df[1:4]

    Name  Age   Address
B  Purva   31    Mandvi
C  Nirja   32       Kim
D   Jiya   19  Magarkui

In [30]:
df[0:1]

     Name  Age Address
A  Siddhi   27   Vyara

In [31]:
df[2:]

    Name  Age   Address
C  Nirja   32       Kim
D   Jiya   19  Magarkui
E  Zinku   17  Magarkui

In [32]:
df[1:3]

    Name  Age Address
B  Purva   31  Mandvi
C  Nirja   32     Kim

In [33]:
by = [1994, 1991, 1990, 2003, 2004]
df['Born Year'] = by
df

     Name  Age   Address  Born Year
A  Siddhi   27     Vyara       1994
B   Purva   31    Mandvi       1991
C   Nirja   32       Kim       1990
D    Jiya   19  Magarkui       2003
E   Zinku   17  Magarkui       2004

In [34]:
clg = ['ABC', 'DEF', 'GHI', 'JKL', 'MNO']
df['College Name'] = clg
df

     Name  Age   Address  Born Year College Name
A  Siddhi   27     Vyara       1994          ABC
B   Purva   31    Mandvi       1991          DEF
C   Nirja   32       Kim       1990          GHI
D    Jiya   19  Magarkui       2003          JKL
E   Zinku   17  Magarkui       2004          MNO

In [35]:
df = df.drop(["Born Year"], axis=1)
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO

In [36]:
df.loc['A']

Name            Siddhi
Age                 27
Address          Vyara
College Name       ABC
Name: A, dtype: object

In [37]:
df.loc["C" : "E"]

    Name  Age   Address College Name
C  Nirja   32       Kim          GHI
D   Jiya   19  Magarkui          JKL
E  Zinku   17  Magarkui          MNO

In [38]:
df.loc["B"]

Name             Purva
Age                 31
Address         Mandvi
College Name       DEF
Name: B, dtype: object

In [39]:
df.loc[["A", "E"]]

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
E   Zinku   17  Magarkui          MNO

In [40]:
df.loc["F"] = ["Janu", 27, "Songadh"]
df

ValueError: cannot set a row with mismatched columns

In [41]:
df.loc["G"] = ["Juhi", 20, "Surat"]
df

ValueError: cannot set a row with mismatched columns

In [42]:
df = df.drop(['G'], axis = 0)
df

KeyError: "['G'] not found in axis"

In [43]:
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO

In [44]:
df.loc["F"] = ['Janu', 27, 'Songadh', 'PQR']
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [45]:
df.loc["G"] = ['Juhi', 20, 'Surat', 'STU']
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR
G    Juhi   20     Surat          STU

In [46]:
df = df.drop(["G"], axis = 0)
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [47]:
df

     Name  Age   Address College Name
A  Siddhi   27     Vyara          ABC
B   Purva   31    Mandvi          DEF
C   Nirja   32       Kim          GHI
D    Jiya   19  Magarkui          JKL
E   Zinku   17  Magarkui          MNO
F    Janu   27   Songadh          PQR

In [48]:
df[['Name', 'Age']].loc[['A', 'D']]

     Name  Age
A  Siddhi   27
D    Jiya   19

In [49]:
df.loc[['A','C']]

     Name  Age Address College Name
A  Siddhi   27   Vyara          ABC
C   Nirja   32     Kim          GHI

In [50]:
df[['Address', 'College Name']].loc[['A', 'D']]

    Address College Name
A     Vyara          ABC
D  Magarkui          JKL

In [51]:
df[['Address', 'College Name']].loc[['A', 'D']]

    Address College Name
A     Vyara          ABC
D  Magarkui          JKL

In [52]:
df[1:]

    Name  Age   Address College Name
B  Purva   31    Mandvi          DEF
C  Nirja   32       Kim          GHI
D   Jiya   19  Magarkui          JKL
E  Zinku   17  Magarkui          MNO
F   Janu   27   Songadh          PQR

In [53]:
df.loc['A']

Name            Siddhi
Age                 27
Address          Vyara
College Name       ABC
Name: A, dtype: object

In [54]:
df.iloc[1]

Name             Purva
Age                 31
Address         Mandvi
College Name       DEF
Name: B, dtype: object

In [55]:
df.iloc([0], [0])

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [56]:
df.iat([0], [0])

TypeError: '_iAtIndexer' object is not callable

In [57]:
df.loc([0], ['Name'])

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [58]:
df['Name'].loc['B': 'E']

B    Purva
C    Nirja
D     Jiya
E    Zinku
Name: Name, dtype: object

In [59]:
df['Address'].loc[['A', 'C']]

A    Vyara
C      Kim
Name: Address, dtype: object

In [60]:
df[['Name', 'College Name']].loc[['B', 'C']]

    Name College Name
B  Purva          DEF
C  Nirja          GHI

In [61]:
df.ix[2]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [62]:
a1 = np.array([1.5, 2, 3, 4, 5])
ser = pd.Series(a1)
ser

0    1.5
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [63]:
d1 = {
    'A' : 1, 'B' : 2, 'C' : 3, 'D' : 4, 'E' : 5
}
df = pd.Series(d1)
df

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [64]:
data = np.array(['g', 'e', 'e', 'k', 's'])
ser = pd.Series(data)
ser

0    g
1    e
2    e
3    k
4    s
dtype: object

In [65]:
import pandas as pd

In [66]:
a = 4
b = 6

In [67]:
a+b

10

In [68]:
a-b

-2

In [69]:
a*b

24

In [70]:
a/b

0.6666666666666666

In [71]:
a//b

0

In [72]:
a**b

4096

In [73]:
a%b

4

In [74]:
a == b

False

In [75]:
a != b

True

In [76]:
a < b

True

In [77]:
a > b

False

In [78]:
a <= b

True

In [79]:
a >= b

False

In [80]:
a and b

6

In [81]:
a or b

4

In [82]:
 not a

False

In [83]:
not b

False

In [84]:
a & b

4

In [85]:
a | b

6

In [86]:
~ b

-7

In [87]:
~ a

-5

In [88]:
a ^ b

2

In [89]:
a << 3

32

In [90]:
a >> 3

0

In [91]:
a = 10
b = a

In [99]:
df = pd.read_excel("pandasss.xlsx")
df

   col1  col2
0     1    45
1     2    54
2     3     7
3     4     8
4     5    45
5     6    98
6     7    77
7     8    52
8     9    98
9    10    45

In [101]:
df = pd.options.display.max_columns

In [102]:
df

20

In [103]:
df = pd.options.display.max_rows

In [104]:
df

60

In [110]:
df = pd.options.display.max_rows = 6
df = pd.read_excel("pandasss.xlsx")

df

    col1  col2
0      1    45
1      2    54
2      3     7
..   ...   ...
7      8    52
8      9    98
9     10    45

[10 rows x 2 columns]

# cheatsheet

In [27]:
data = {
    'a' : [4, 5, 6],
    'b' : [7, 8, 9],
    'c' : [10, 11, 12]
}
df = pd.DataFrame(data, index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [6]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index = [1, 2, 3],
columns = ['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
data = {
    'a' : [4, 5, 6],
    'b' : [7, 8, 9],
    'c' : [10, 11, 12]
}
df = pd.DataFrame(data)
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [5]:
pd.melt(df)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [29]:
df.pivot(columns = 'variable', values = 'value')

KeyError: 'variable'

In [9]:
data = {
    'name' : ['a', 'b', 'c'],
    'age' : [14, 15, 16],
    'address' : ['mumbai', 'pune', 'delhi']
    
}
df1 = pd.DataFrame(data)
df1

  name  age address
0    a   14  mumbai
1    b   15    pune
2    c   16   delhi

In [22]:
data = {
    'name' : ['x', 'y', 'z'],
    'age' : [22, 23, 24],
    'address' : ['surat', 'vadodara', 'rajkot']
}
df2 = pd.DataFrame(data)
df2

  name  age   address
0    x   22     surat
1    y   23  vadodara
2    z   24    rajkot

In [23]:
pd.concat([df1, df2])

  name  age   address
0    a   14    mumbai
1    b   15      pune
2    c   16     delhi
0    x   22     surat
1    y   23  vadodara
2    z   24    rajkot

In [24]:
pd.concat([df1, df2], axis = 1)

  name  age address name  age   address
0    a   14  mumbai    x   22     surat
1    b   15    pune    y   23  vadodara
2    c   16   delhi    z   24    rajkot

In [32]:
sort_values(by = [ascending = True)

NameError: name 'sort_values' is not defined